Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
// ============================================================
//  Load calibration data from Preferences
// ============================================================
void loadCalibrationData() {
  preferences.begin("calibration", false);

  // Load pH calibration
  ph_cal.slope = preferences.getFloat("ph_slope", -0.07);
  ph_cal.offset = preferences.getFloat("ph_offset", 161.00);
  ph_cal.is_calibrated = preferences.getBool("ph_cal", false);
  ph_cal.num_points = preferences.getInt("ph_points", 0);
  ph_cal.point1_voltage = preferences.getFloat("ph_p1_v", 2310.0);
  ph_cal.point1_ph = preferences.getFloat("ph_p1_ph", 7.0);
  ph_cal.point2_voltage = preferences.getFloat("ph_p2_v", 2355.0);
  ph_cal.point2_ph = preferences.getFloat("ph_p2_ph", 4.0);

  // Load TDS calibration
  tds_cal.slope = preferences.getFloat("tds_slope", 1.0);
  tds_cal.offset = preferences.getFloat("tds_offset", 0.0);
  tds_cal.is_calibrated = preferences.getBool("tds_cal", false);
  tds_cal.num_points = preferences.getInt("tds_points", 0);
  tds_cal.point1_voltage = preferences.getFloat("tds_p1_v", 0.0);
  tds_cal.point1_tds = preferences.getFloat("tds_p1_tds", 0.0);
  tds_cal.point2_voltage = preferences.getFloat("tds_p2_v", 0.0);
  tds_cal.point2_tds = preferences.getFloat("tds_p2_tds", 1330.0);

  // Load UltraSonic calibration
  us_cal.slope = preferences.getFloat("us_slope", 1.0);
  us_cal.offset = preferences.getFloat("us_offset", 0.0);
  us_cal.is_calibrated = preferences.getBool("us_cal", false);
  us_cal.num_points = preferences.getInt("us_points", 0);
  us_cal.point1_voltage = preferences.getFloat("us_p1_v", 0.0);
  us_cal.point1_us = preferences.getFloat("us_p1_us", 0.0);
  us_cal.point2_voltage = preferences.getFloat("us_p2_v", 0.0);
  us_cal.point2_us = preferences.getFloat("us_p2_us", 0.0);

  preferences.end();
}


// ============================================================
//  Save calibration data to Preferences
// ============================================================
void saveCalibrationData() {
  preferences.begin("calibration", false);

  // Save pH calibration
  preferences.putFloat("ph_slope", ph_cal.slope);
  preferences.putFloat("ph_offset", ph_cal.offset);
  preferences.putBool("ph_cal", ph_cal.is_calibrated);
  preferences.putInt("ph_points", ph_cal.num_points);
  preferences.putFloat("ph_p1_v", ph_cal.point1_voltage);
  preferences.putFloat("ph_p1_ph", ph_cal.point1_ph);
  preferences.putFloat("ph_p2_v", ph_cal.point2_voltage);
  preferences.putFloat("ph_p2_ph", ph_cal.point2_ph);

  // Save TDS calibration
  preferences.putFloat("tds_slope", tds_cal.slope);
  preferences.putFloat("tds_offset", tds_cal.offset);
  preferences.putBool("tds_cal", tds_cal.is_calibrated);
  preferences.putInt("tds_points", tds_cal.num_points);
  preferences.putFloat("tds_p1_v", tds_cal.point1_voltage);
  preferences.putFloat("tds_p1_tds", tds_cal.point1_tds);
  preferences.putFloat("tds_p2_v", tds_cal.point2_voltage);
  preferences.putFloat("tds_p2_tds", tds_cal.point2_tds);

  // Save UltraSonic calibration
  preferences.putFloat("us_slope", us_cal.slope);
  preferences.putFloat("us_offset", us_cal.offset);
  preferences.putBool("us_cal", us_cal.is_calibrated);
  preferences.putInt("us_points", us_cal.num_points);
  preferences.putFloat("us_p1_v", us_cal.point1_voltage);
  preferences.putFloat("us_p1_us", us_cal.point1_us);
  preferences.putFloat("us_p2_v", us_cal.point2_voltage);
  preferences.putFloat("us_p2_us", us_cal.point2_us);

  preferences.end();
}


// ============================================================
//  Calculate two-point calibration (slope & offset)
// ============================================================
void calculateTwoPointCalibration(
  float v1, float val1,   // First point (voltage, value)
  float v2, float val2,   // Second point (voltage, value)
  float &slope,           // Output: calculated slope
  float &offset           // Output: calculated offset
) {
  // Avoid division by zero
  if (abs(v2 - v1) < 0.001) {
    Serial.println("⚠️ Warning: Calibration points too close, using default");
    return;
  }

  // Calculate slope: (y2 - y1) / (x2 - x1)
  slope = (val1 - val2) / (v1 - v2);
  // Calculate offset: y = slope * x + offset  →  offset = y - slope * x
  offset = val1 - (slope * v1);
}


// ============================================================
//  Convert raw ADC to voltage
// ============================================================
float rawToVoltage(int raw_adc) {
  return (raw_adc / ADC_RESOLUTION) * VREF;
}

// ============================================================
//  Read raw ADC value with averaging
// ============================================================
float readADCAverage(int pin, int samples) {
  long sum = 0;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(pin);
    delay(SAMPLE_DELAY);
  }
  return (float)sum / samples;
}

float readADCFilterVoltage(int pin) {
    const int NUM_SAMPLES = 20;        // Increased from 10 for better stability
    const int DISCARD_SAMPLES = 4;     // Discard 4 lowest + 4 highest
    const float ALPHA = 0.30;          // EMA filter coefficient (0.1-0.3)
    static float ema_voltage = 0;      // Exponential Moving Average
    static bool ema_initialized = false;

    int samples[NUM_SAMPLES];

    // 1. Collect samples with delay for ADC settling
    for (int i = 0; i < NUM_SAMPLES; i++) {
        samples[i] = analogRead(pin);
        delay(20);  // ADC settling time
    }

    // 2. Sort samples (bubble sort)
    for (int i = 0; i < NUM_SAMPLES - 1; i++) {
        for (int j = i + 1; j < NUM_SAMPLES; j++) {
            if (samples[i] > samples[j]) {
                int temp = samples[i];
                samples[i] = samples[j];
                samples[j] = temp;
            }
        }
    }

    // 3. Remove outliers - discard lowest and highest values
    int sum = 0;
    int count = 0;
    for (int i = DISCARD_SAMPLES; i < NUM_SAMPLES - DISCARD_SAMPLES; i++) {
        sum += samples[i];
        count++;
    }

