Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
    // 4. Calculate average of middle values
    float avgValue = sum / (float)count;

    // 5. Convert to voltage (mV)
    float voltage = avgValue * (3300.0 / 4095.0);

    // 6. Apply Exponential Moving Average (EMA) filter
    if (!ema_initialized) {
        ema_voltage = voltage;
        ema_initialized = true;
    } else {
        ema_voltage = (ALPHA * voltage) + ((1.0 - ALPHA) * ema_voltage);
    }

    // 7. Optional: Apply median filter on final result
    static float voltage_history[5] = {0};
    static int history_index = 0;

    voltage_history[history_index] = ema_voltage;
    history_index = (history_index + 1) % 5;

    // Sort history for median
    float sorted_history[5];
    memcpy(sorted_history, voltage_history, sizeof(voltage_history));
    for (int i = 0; i < 4; i++) {
        for (int j = i + 1; j < 5; j++) {
            if (sorted_history[i] > sorted_history[j]) {
                float temp = sorted_history[i];
                sorted_history[i] = sorted_history[j];
                sorted_history[j] = temp;
            }
        }
    }

    // Return median value (middle of 5 samples)
    return sorted_history[2];
}

// ============================================================
//  ★ IMPROVED pH CONVERSION ★
//  Uses two-point calibration (slope + offset)
// ============================================================
float convertToPH() {
  // Convert ADC to voltage
  float voltage = readADCFilterVoltage(PH_PIN);
  float ph_base = (ph_cal.slope * voltage) + ph_cal.offset;
  return ph_base;  // Return uncalibrated if not calibrated
}


// ============================================================
//  ★ IMPROVED TDS CONVERSION ★
//  Uses two-point calibration (slope + offset)
// ============================================================
float convertToTDS(int raw_adc, float temperature) {
  // Convert ADC to voltage
  float voltage = rawToVoltage(raw_adc);

  // Temperature compensation
  float compensationCoefficient = 1.0 + 0.02 * (temperature - 25.0);
  float compensationVoltage = voltage / compensationCoefficient;

  // Base TDS calculation (polynomial formula)
  float tds_base = (133.42 * compensationVoltage * compensationVoltage * compensationVoltage
                    - 255.86 * compensationVoltage * compensationVoltage
                    + 857.39 * compensationVoltage) * 0.5;

  // Apply calibration: TDS_calibrated = slope * TDS_base + offset

  if (tds_cal.num_points == 1) {
    return tds_base + tds_cal.offset;
  }

  if (tds_cal.num_points == 2) {
    return (tds_cal.slope * tds_base) + tds_cal.offset;
  }

  return tds_base;  // Return uncalibrated if not calibrated
}

// ============================================================
// Read Current Flow Rate (L/min)
// ============================================================
float readFlowRate() {
  // Read current pulse count
  uint32_t currentPulses = pulseCount;

  // Calculate volume from pulses
  float volume = currentPulses / FLOW_CALIBRATION_FACTOR;

  // Calculate time elapsed in minutes
  unsigned long elapsedTime = millis() - flowStartTime;
  float elapsedMinutes = elapsedTime / 60000.0;  // Convert milliseconds to minutes

  // Avoid division by zero
  if (elapsedMinutes < 0.001) {
    return 0.0;
  }

  // Flow rate = Volume / Time
  flowRate = volume / elapsedMinutes;
  return flowRate;
}

// ============================================================
// Reset Flow Measurement
// Call this to start a new flow measurement
// ============================================================
void resetFlowMeasurement() {
  pulseCount = 0;
  totalVolume = 0.0;
  flowRate = 0.0;
  flowStartTime = millis();
  lastPulseTime = millis();
}


float readUltraSonicSensor() {
  // Send 10µs pulse on trigger pin
  digitalWrite(US_TRIG_PIN, LOW);
  delayMicroseconds(4);  // Ensure LOW for at least 2µs

  digitalWrite(US_TRIG_PIN, HIGH);
  delayMicroseconds(10);  // HIGH for 10µs
  digitalWrite(US_TRIG_PIN, LOW);

  // Measure the duration of the echo pulse
  // pulseIn() waits for pin to go HIGH, then measures how long it stays HIGH
  unsigned long echoPulse = pulseIn(US_ECHO_PIN, HIGH, ECHO_TIMEOUT);

  if (echoPulse == 0) {
    Serial.println("Error: No echo received (timeout)");
    return 0.0;
  }

  // Calculate distance using the echo pulse width
  // Distance (cm) = (Echo_time_in_µs / 2) * speed_of_sound_in_cm/µs
  // Divided by 2 because sound travels to object AND back
  float raw_distance = (echoPulse / 2.0) * SOUND_SPEED;
  if (raw_distance < 2.0 || raw_distance > 450.0) {
    Serial.printf("Warning: Distance out of range: %.2f cm\n", raw_distance);
    return 0.0;
  }

  // Apply manual two-point calibration
  float distance = (raw_distance * us_cal.slope) + us_cal.offset;
  return distance;
}

float readUltraSonicSensorAverage() {
  float distanceSum = 0;
  uint8_t count = 0;

  float tmp = 0.0;
  for (uint8_t i=1;i<=10;i++) {
    tmp = readUltraSonicSensor();
    delay(60);
    if (tmp != 0.0) {
      distanceSum += tmp;
      count++;
    }
  }

  if (count > 0) {
    return (distanceSum / (float)count);
  } else {
    Serial.println("❌ No valid ultrasonic readings!");
    return 0.0;  // Return 0 instead of dividing by zero
  }
}

float readLightIntensity() {
  // Try to read from BH1750
  float lux = luxmeter.readLightLevel();

  // BH1750 returns 65535 or < 0 on error or if not configured
  if (lux == 65535.0 || lux < 0.0) {
    Serial.println("⚠️ BH1750 reading error - check sensor connection");
    return -1.0;  // Return -1 to indicate error
  }

  return lux;
}


// ============================================================
//  ★ IMPROVED pH CALIBRATION ★
//  Supports both one-point and two-point calibration
// ============================================================
bool calibratePH(float known_ph_value) {
  Serial.println("\n🧪 Starting pH Calibration...");
  Serial.printf("   Target pH: %.2f\n", known_ph_value);
  Serial.printf("   Current calibration points: %d\n", ph_cal.num_points);
  Serial.println("   Taking readings...");

  float voltage = readADCFilterVoltage(PH_PIN);
  float base_ph = (voltage * ph_cal.slope) + ph_cal.offset;

  Serial.printf("   Voltage: %.3f mV\n", voltage);
  Serial.printf("   Base pH (uncalibrated): %.2f\n", base_ph);

  // Determine if this is first or second calibration point
  if (ph_cal.num_points == 0 || known_ph_value == 4.0) {
    Serial.println("   → Setting as calibration point 1");

