Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
    ph_cal.point1_voltage = voltage;
    ph_cal.point1_ph = known_ph_value;
    ph_cal.num_points = 1;

    Serial.printf("   One-point calibration applied\n");
    Serial.printf("   Offset: %.3f\n", ph_cal.offset);

  } else if (ph_cal.num_points == 1 || known_ph_value == 7.0) {
    Serial.println("   → Setting as calibration point 2");

    if (abs(known_ph_value - ph_cal.point1_ph) < 1.0) {
      Serial.println("⚠️ Warning: Calibration points should be at least 1 pH unit apart!");
      Serial.println("   (Recommended: pH 4 and pH 7, or pH 7 and pH 10)");
    }

    ph_cal.point2_voltage = voltage;
    ph_cal.point2_ph = known_ph_value;
    ph_cal.num_points = 2;

    ph_cal.is_calibrated = true;
    Serial.println("   Two-point calibration applied!");

  } else {
    return false;
  }

  // Calculate two-point calibration
  // Map voltage range to pH range
  calculateTwoPointCalibration(
    ph_cal.point1_voltage, ph_cal.point1_ph,
    ph_cal.point2_voltage, ph_cal.point2_ph,
    ph_cal.slope, ph_cal.offset
  );

  saveCalibrationData();
  return true;
}


// ============================================================
//  ★ IMPROVED TDS CALIBRATION ★
//  Supports both one-point and two-point calibration
// ============================================================
bool calibrateTDS(float known_tds_value) {
  Serial.println("\n🧪 Starting TDS Calibration...");
  Serial.printf("   Target TDS: %.2f ppm\n", known_tds_value);
  Serial.printf("   Current calibration points: %d\n", tds_cal.num_points);
  Serial.println("   Taking readings...");

  watertemp.requestTemperatures();
  delay(10);
  float temperature = watertemp.getTempCByIndex(0);
  float raw_adc = readADCAverage(TDS_PIN, CALIBRATION_SAMPLES);
  float voltage = rawToVoltage((int)raw_adc);

  float compensationCoefficient = 1.0 + 0.02 * (temperature - 25.0);
  float compensationVoltage = voltage / compensationCoefficient;
  float base_tds = (133.42 * compensationVoltage * compensationVoltage * compensationVoltage
                    - 255.86 * compensationVoltage * compensationVoltage
                    + 857.39 * compensationVoltage) * 0.5;

  Serial.printf("   Voltage: %.3f V\n", voltage);
  Serial.printf("   Base TDS (uncalibrated): %.2f ppm\n", base_tds);

  if (tds_cal.num_points == 0 || tds_cal.num_points == 1 ) {
    // First calibration point
    Serial.println("   → Setting as calibration point 1");

    tds_cal.point1_voltage = compensationVoltage;
    tds_cal.point1_tds = known_tds_value;
    tds_cal.num_points = 1;

    // One-point calibration
    tds_cal.slope = 1.0;
    tds_cal.offset = known_tds_value - base_tds;
    tds_cal.is_calibrated = true;

    Serial.printf("   One-point calibration applied\n");
    Serial.printf("   Offset: %.2f ppm\n", tds_cal.offset);

  }

  saveCalibrationData();
  return true;
}

// ============================================================
//  ★ IMPROVED ULTRASONIC CALIBRATION ★
//  Supports both one-point and two-point calibration
// ============================================================
bool calibrateUS(float known_us_value) {
  Serial.println("\n🧪 Starting US Calibration...");
  Serial.printf("   Target US: %.2f\n", known_us_value);
  Serial.printf("   Current calibration points: %d\n", us_cal.num_points);
  Serial.println("   Taking readings...");

  float base_us = readUltraSonicSensorAverage();
  Serial.printf("   Base US (uncalibrated): %.2f cm\n", base_us);

  if (us_cal.num_points == 0) {
    Serial.println("   → Setting as calibration point 1");
    us_cal.point1_voltage = base_us;
    us_cal.point1_us = known_us_value;
    us_cal.num_points = 1;
    Serial.printf("   One-point calibration applied\n");
  } else if (us_cal.num_points == 1) {
    Serial.println("   → Setting as calibration point 2");

    if (abs(known_us_value - us_cal.point1_us) < 1.0) {
      Serial.println("⚠️ Warning: Calibration points should be at least 1cm unit apart!");
    }

    us_cal.point2_voltage = base_us;
    us_cal.point2_us = known_us_value;
    us_cal.num_points = 2;
  } else {
    return false;
  }

  calculateTwoPointCalibration(
    us_cal.point1_voltage, us_cal.point1_us,
    us_cal.point2_voltage, us_cal.point2_us,
    us_cal.slope, us_cal.offset
  );
  saveCalibrationData();
  return true;
}

// ============================================================
//  Reset calibration to factory defaults
// ============================================================
bool resetCalibration(const char* sensor_type) {
  Serial.printf("\n🔄 Resetting %s calibration...\n", sensor_type);

  preferences.begin("calibration", false);

  if (strcmp(sensor_type, "PH") == 0 || strcmp(sensor_type, "ALL") == 0) {
    preferences.putFloat("ph_slope", 1.0);
    preferences.putFloat("ph_offset", 0.0);
    preferences.putBool("ph_cal", false);
    preferences.putInt("ph_points", 0);
    preferences.putFloat("ph_p1_v", 0.0);
    preferences.putFloat("ph_p1_ph", 0.0);
    preferences.putFloat("ph_p2_v", 0.0);
    preferences.putFloat("ph_p2_ph", 0.0);

    Serial.println("   ✅ pH calibration reset");
  }

  if (strcmp(sensor_type, "TDS") == 0 || strcmp(sensor_type, "ALL") == 0) {
    preferences.putFloat("tds_slope", 1.0);
    preferences.putFloat("tds_offset", 0.0);
    preferences.putBool("tds_cal", false);
    preferences.putInt("tds_points", 0);
    preferences.putFloat("tds_p1_v", 0.0);
    preferences.putFloat("tds_p1_tds", 0.0);
    preferences.putFloat("tds_p2_v", 0.0);
    preferences.putFloat("tds_p2_tds", 0.0);

    Serial.println("   ✅ TDS calibration reset");
  }

  if (strcmp(sensor_type, "US") == 0 || strcmp(sensor_type, "ALL") == 0) {
    preferences.putFloat("us_slope", 1.0);
    preferences.putFloat("us_offset", 0.0);
    preferences.putBool("us_cal", false);
    preferences.putInt("us_points", 0);
    preferences.putFloat("us_p1_v", 0.0);
    preferences.putFloat("us_p1_us", 0.0);
    preferences.putFloat("us_p2_v", 0.0);
    preferences.putFloat("us_p2_us", 0.0);

    Serial.println("   ✅ US calibration reset");
  }

