Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
  preferences.end();
  Serial.println("✅ Reset complete!\n");
  loadCalibrationData();

  return true;
}


// ============================================================
//  Print calibration status
// ============================================================
void printCalibrationStatus() {
  Serial.println("\n📊 CALIBRATION STATUS");
  Serial.println("========================");

  // pH Status
  Serial.println("pH Sensor:");
  Serial.printf("  Calibrated: %s\n", ph_cal.is_calibrated ? "YES" : "NO");
  Serial.printf("  Points: %d\n", ph_cal.num_points);
  Serial.printf("  Slope: %.4f\n", ph_cal.slope);
  Serial.printf("  Offset: %.3f\n", ph_cal.offset);
  Serial.printf("  point1_ph: %.3f\n", ph_cal.point1_ph);
  Serial.printf("  point2_ph: %.3f\n", ph_cal.point2_ph);
  Serial.printf("  point1_voltage: %.3f\n", ph_cal.point1_voltage);
  Serial.printf("  point2_voltage: %.3f\n", ph_cal.point2_voltage);
  if (ph_cal.num_points >= 1) {
    Serial.printf("  Point 1: pH %.2f @ %.3fV\n", ph_cal.point1_ph, ph_cal.point1_voltage);
  }
  if (ph_cal.num_points >= 2) {
    Serial.printf("  Point 2: pH %.2f @ %.3fV\n", ph_cal.point2_ph, ph_cal.point2_voltage);
  }

  Serial.println("\nTDS Sensor:");
  Serial.printf("  Calibrated: %s\n", tds_cal.is_calibrated ? "YES" : "NO");
  Serial.printf("  Points: %d\n", tds_cal.num_points);
  Serial.printf("  Slope: %.4f\n", tds_cal.slope);
  Serial.printf("  Offset: %.2f ppm\n", tds_cal.offset);
  if (tds_cal.num_points >= 1) {
    Serial.printf("  Point 1: %.0f ppm @ %.3fV\n", tds_cal.point1_tds, tds_cal.point1_voltage);
  }
  if (tds_cal.num_points >= 2) {
    Serial.printf("  Point 2: %.0f ppm @ %.3fV\n", tds_cal.point2_tds, tds_cal.point2_voltage);
  }

  Serial.println("========================\n");
}

// ============================================================
//  Generate sensor data with calibration applied
// ============================================================
void generateData(JsonObject doc) {
  watertemp.requestTemperatures();
  delay(100);

  float temperature = watertemp.getTempCByIndex(0);
  int raw_ph = analogRead(PH_PIN);
  int raw_tds = analogRead(TDS_PIN);

  // Apply calibration
  float calibrated_ph = convertToPH();
  float calibrated_tds = convertToTDS(raw_tds, temperature);

  resetFlowMeasurement();
  delay(DELAY_FLOW_RATE);

  float tmp = round(calibrated_ph * 100) / 100.0;
  if (tmp < 0.0) {
    tmp = 0.0;
  } else if (tmp > 14.0) {
    tmp = 14.0;
  } else if (tmp < -2.5 || tmp > 16.5) {
    loadPreviousData();
    tmp = ld.prev_ph;
  }

  ld.prev_ph = tmp;
  savePreviousData();

  doc["ph"] = tmp;
  doc["ec"] = round(calibrated_tds * 100) / 100.0;
  doc["water_temp"] = round(temperature * 10) / 10.0;
  doc["light_intensity"] = readLightIntensity();
  doc["water_level"] = readUltraSonicSensorAverage();
  doc["flow_rate"] = round(readFlowRate() * 100) / 100.0;
}

// ============================================================
//  WiFi connection
// ============================================================
void connectWiFi() {
  if (WiFi.status() == WL_CONNECTED) return;

  Serial.printf("\n📡 Connecting to WiFi: %s", WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(500);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n✅ WiFi connected! IP: %s\n", WiFi.localIP().toString().c_str());
  } else {
    Serial.println("\n❌ WiFi connection failed! Retrying in 5s...");
    delay(5000);
  }
}

// ============================================================
//  MQTT connection
// ============================================================
void connectMQTT() {
  if (mqtt.connected()) return;

  Serial.printf("🔌 Connecting to MQTT: %s:%d...\n", MQTT_SERVER, MQTT_PORT);

  while (!mqtt.connected()) {
    if (mqtt.connect(client_id, MQTT_USER, MQTT_PASSWORD)) {
      Serial.printf("✅ MQTT connected as '%s'\n", client_id);
      Serial.printf("📤 Publishing to topic: %s\n", mqtt_topic);

      mqtt.subscribe(cmd_Topic);
      mqtt.subscribe(signin_ack);
      Serial.printf("📥 Subscribing to topic: %s\n\n", cmd_Topic);
    } else {
      Serial.printf("❌ MQTT failed (rc=%d). Retrying in 3s...\n", mqtt.state());
      delay(3000);
    }
  }
}

void registerDevice() {
  JsonDocument doc;

  doc["mac_addr"] = mac_addr;
  doc["type_id"] = TYPE_ID;
  doc["desc"] = DESC_DEVICE;

  JsonObject desc = doc["attr"].to<JsonObject>();
  desc["about"] = "ini esp32 untuk rack " + String(RACK_ID);
  desc["rack_id"] = String(RACK_ID);

  char payload[256];
  serializeJson(doc, payload);

  if (mqtt.publish(signin_topic, payload)) {
    Serial.println("✅ Device registration sent");
    Serial.println(payload);
  } else {
    Serial.println("❌ Device registration failed");
  }
}

// ============================================================
//  Deserialize String to JSON
// ============================================================
bool parseJSON(char* json_obj, JsonDocument& doc) {
  DeserializationError err = deserializeJson(doc, json_obj);

  if (err) {
    Serial.println("deserialized JSON failed");
    return false;
  }
  return true;
}

// ============================================================
//  Run Command for Actuator
// ============================================================
enum statusType {
  FAILED = -1,
  PENDING_b = 0,
  SUCCESS = 1
};

const char * cmd_RESET_CALIBRATION = "RESET_CALIBRATION";

statusType runCommand(const char* cmdType, JsonObject doc, StaticJsonDocument<512>& prev) {
  // ★ pH Calibration Command
  if (strcmp(cmdType, cmd_PH_CALIBRATION) == 0) {
    float known_value = doc["known_value"] | 7.0;  // Default to pH 7 if not provided

    if (calibratePH(known_value)) {
      // Apply calibration
      float calibrated_ph = convertToPH();
      doc["ph"] = round(calibrated_ph * 100) / 100.0;
      return SUCCESS;
    } else {
      return FAILED;
    }
  }

  // ★ TDS Calibration Command
  else if (strcmp(cmdType, cmd_TDS_CALIBRATION) == 0) {
    float known_value = doc["known_value"] | 1382.0;  // Default to 1382 ppm

    if (calibrateTDS(known_value)) {
      watertemp.requestTemperatures();
      delay(100);
      float temperature = watertemp.getTempCByIndex(0);
      int raw_tds = analogRead(TDS_PIN);
      float calibrated_tds = convertToTDS(raw_tds, temperature);
      doc["ec"] = round(calibrated_tds * 100) / 100.0;
      return SUCCESS;
    } else {
      return FAILED;
    }
  }

  // ★ Reset Calibration Command
  else if (strcmp(cmdType, cmd_RESET_CALIBRATION) == 0) {
    bool ph_ok = resetCalibration("PH");
    bool tds_ok = resetCalibration("TDS");

    if (ph_ok && tds_ok) {
      doc["reset"] = "ALL";
      return SUCCESS;
    } else {
      return FAILED;
    }
  }

